/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "การทำงานไม่สำเร็จ";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "ข้อผิดพลาดไม่มีชื่อเกิดขึ้น (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "ไม่สามารถกระทำให้เสร็จ";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "ลองอีกครั้งภายหลัง";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "ไม่สามารถอัด";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "ลองอัดอีกครั้ง";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "ไม่สามารถอัด";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "หยุดการทำงานอื่นๆ ที่ใช้%@ และลองอีกครั้ง"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "ไม่สามารถอัด";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "ลองอัดอีกครั้ง";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "การอัดหยุด";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "ลองอัดอีกครั้ง";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "การทำงานหยุด";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "เนื้อที่ดิสก์ไม่เพียงพอที่จะเขียนลงไฟล์ต่อ ลบวิดีโอหรือรูปภาพที่มีอยู่จะทำให้เนื้อที่มากขึ้น";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "การอัดหยุด";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "ลองอัดอีกครั้ง";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "การอัดหยุด";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "ลองอัดอีกครั้ง";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "การอัดหยุด";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "การอัดได้ถึงระยะสูงสุดที่อนุญาตแล้ว"; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "การอัดหยุด";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "การอัดได้ถึงขนาดไฟล์สูงสุดที่อนุญาตแล้ว"; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "การอัดหยุด";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "หยุดการทำงานอื่นๆ ที่ใช้อุปกรณ์อัดและลองอีกครั้ง";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "การอัดหยุด";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "การอัดได้ถึงระยะสูงสุดที่อนุญาตแล้ว"; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "ไม่สามารถอัด";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "ลองอัดอีกครั้ง";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "ไม่สามารถใช้%@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "หยุดการทำงานอื่นๆ ที่ใช้%@ และลองอีกครั้ง"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "ไม่สามารถใช้%@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "หยุดการทำงานอื่นๆ ที่ใช้%@ และลองอีกครั้ง"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "การอัดหยุด";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "หยุดการทำงานอื่นๆ ที่ใช้อุปกรณ์อัดและลองอีกครั้ง";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_Description" = "แฟลชเปิดไม่ได้";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_RecoverySuggestion" = "ลองพยายามเปิดแสงแฟลชให้น้อยลง";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "ไม่สามารถกระทำให้เสร็จ";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "ลองอีกครั้งภายหลัง";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "ไม่สามารถส่งออกให้เสร็จ";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "ลองส่งออกอีกครั้ง";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "ไม่สามารถถอดรหัส";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "ข้อมูลสื่อถอดรหัสไม่ได้ ข้อมูลสื่ออาจเสียหาย";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "รูปแบบของสื่อนี้ไม่รองรับ";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "ไม่สามารถบันทึก";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "ลองบันทึกอีกครั้ง";

"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_Description" = "ไม่สามารถเขียนไฟล์ออก";
"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_RecoverySuggestion" = "เปลี่ยนประเภทของไฟล์ออกแล้วลองอีกครั้ง";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "สื่อนี้ใช้ไม่ได้";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "สื่อนี้ใช้ไม่ได้";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "สื่อนี้ใช้ไม่ได้";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "สื่อนี้ใช้ไม่ได้";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "รูปแบบของสื่อนี้ไม่รองรับ";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "สื่อนี้อาจเสียหาย";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "ไม่สามารถถ่ายรูป";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "ลองถ่ายรูปอีกครั้ง";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "การทำงานหยุด";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "การทำงานนี้ไม่รองรับเนื้อหาที่ป้องกันไว้"; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "เนื้อหานี้ไม่ได้รับอนุญาต"; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "แอปฯ นี้ไม่ได้รับอนุญาตให้เล่นไฟล์นี้"; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "สื่อนี้ใช้ไม่ได้";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "ไม่สามารถถอดรหัส";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "ตัวถอดรหัสข้อมูลที่ต้องการสำหรับสื่อนี้หาไม่พบ";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "ไม่สามารถเข้ารหัส";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "ตัวเข้ารหัสข้อมูลสำหรับสื่อนี้หาไม่พบ";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "ไม่สามารถถอดรหัส";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "ตัวถอดรหัสข้อมูลที่ต้องการสำหรับสื่อนี้ไม่ว่าง";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "หยุดการทำงานอื่นๆ ที่ถอดรหัสสื่อและลองอีกครั้ง";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "ไม่สามารถเข้ารหัส";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "ตัวเข้ารหัสข้อมูลที่ต้องการสำหรับสื่อนี้ไม่ว่าง";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "หยุดการทำงานอื่นๆ ที่เข้ารหัสสื่อและลองอีกครั้ง";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "ไม่สามารถใช้%@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "แอปฯ อาจจะไม่ใช้%@ ในขณะที่ทำงานอยู่เบื้องหลัง"; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "การทำงานหยุด";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "การทำงานนี้ไม่รองรับสื่อนี้";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "การทำงานหยุด";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "ไม่สามารถจัดทำวิดีโอขึ้นได้ตามวิธีการที่ให้มา";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "สื่อนี้ใช้ไม่ได้";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "การทำงานหยุด";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "ไฟล์แคชที่ URL ปลายทางสำหรับดาวน์โหลดใช้ไม่ได้";

"AVFoundationErrorDomain_AVErrorFileChecksumFailed_Description" = "การทำงานหยุด";
"AVFoundationErrorDomain_AVErrorFileChecksumFailed_FailureReason" = "การตรวจสอบรวมของไฟล์ไม่ถูกต้อง";

"AVFoundationErrorDomain_AVErrorOperationInterrupted_Description" = "การทำงานเกิดขัดจังหวะ";
"AVFoundationErrorDomain_AVErrorOperationInterrupted_RecoverySuggestion" = "หยุดการทำงานอื่นแล้วลองอีกครั้ง";

"AVFoundationErrorDomain_AVErrorIncompatibleAsset_Description" = "ไม่สามารถเปิด";
"AVFoundationErrorDomain_AVErrorIncompatibleAsset_FailureReason" = "สื่อใช้ไม่ได้กับอุปกรณ์นี้";

"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_Description" = "การทำงานหยุด";
"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_FailureReason" = "สื่อนี้อาจเสียหาย";

"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_Description" = "การทำงานหยุด";
"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_FailureReason" = "กำหนดค่าเซิร์ฟเวอร์ไม่ถูกต้อง";
